---

C#Visual BasicVisual C++

Revit 2024 API
---
RouteAnalysisSettings..::..GetRouteAnalysisSettings Method
RouteAnalysisSettings Class See Also Send Feedback
---

Returns the RouteAnalysisSettings element for a given document.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020

# Syntax

C#
---

    public static RouteAnalysisSettings GetRouteAnalysisSettings(
    	Document cda
    )

Visual Basic
---

    Public Shared Function GetRouteAnalysisSettings ( _
    	cda As Document _
    ) As RouteAnalysisSettings

Visual C++
---

    public:
    static RouteAnalysisSettings^ GetRouteAnalysisSettings(
    	Document^ cda
    )

#### Parameters

cda
    Type: Autodesk.Revit.DB..::..Document The document for which to get the RouteAnalysisSettings element.

#### Return Value

Returns the RouteAnalysisSettings element in project documents or nullNothingnullptra null reference (Nothing in Visual Basic) for family documents

.

# Remarks

Project documents have a RouteAnalysisSettings element, one per document. Family documents do not have RouteAnalysisSettings elements.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also

RouteAnalysisSettings Class

Autodesk.Revit.DB.Analysis Namespace